run/acousticCavitationCloudFoam/verification_wedge2D_Louisnard2012/0_orig/PAcRe
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      PAcRe;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    Walls
    {
        type            zeroGradient;
    }
    Transducer
    {
        type            fixedGradient;
        gradient        uniform 32514190.45;
    }
    TransducerLateralWall
    {
        type            fixedGradient;
        gradient        uniform -9.47e+6;
    }
    FreeSurface
    {
        type            fixedValue;
        value           uniform 0;
    }
    Front
    {
        type            wedge;
    }
    Back
    {
        type            wedge;
    }
}
