run/acousticCavitationCloudFoam/verification_wedge2D_Louisnard2012/0_orig/kSqrIm
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      kSqrIm;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -2 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Walls
    {
        type            zeroGradient;
    }

    FreeSurface
    {
        type            zeroGradient;
    }

    Transducer
    {
        type            zeroGradient;
    }
    
    TransducerLateralWall
    {
        type            zeroGradient;
    }

    Front
    {
        type            wedge;
    }
    
    Back
    {
        type            wedge;
    }
}

// ************************************************************************* //
