run/acousticCavitationCloudFoam/verification_wedge2D_Louisnard2012/0_orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField uniform 0;

boundaryField
{
    Transducer
    {
        type            zeroGradient;
    }
    TransducerLateralWall
    {
        type            zeroGradient;
    }
    FreeSurface
    {
        type            slip;
    }
    Walls
    {
        type            zeroGradient;
    }
    Axis
    {
        type            empty;
    }
    Front
    {
        type            wedge;
    }
    Back
    {
        type            wedge;
    }
}


// ************************************************************************* //
