run/acousticCavitationCloudFoam/verification_wedge2D_Louisnard2012/constant/bubbleGeneralPDFs
bubbleGeneralPDFs_jet
(
    // Bubble PDF size distribution for jet
    // PDF normalization: \int F(dEqu/1e-6) d dEqu = 1
    // (dEqu, Phi)
    (6.00e-06     0.87219)
    (6.40e-06     0.67312)
    (6.80e-06     0.56688)
    (7.20e-06     0.48394)
    (7.60e-06     0.41385)
    (8.00e-06     0.35397)
    (8.40e-06     0.30277)
    (8.80e-06     0.25897)
    (9.20e-06     0.22151)
    (9.60e-06     0.18947)
    (1.00e-05     0.16206)
    (1.04e-05     0.13862)
    (1.08e-05     0.11857)
    (1.12e-05     0.10142)
    (1.16e-05     0.08674)
    (1.20e-05     0.07420)
    (1.24e-05     0.06346)
    (1.28e-05     0.05428)
    (1.32e-05     0.04643)
    (1.36e-05     0.03971)
    (1.40e-05     0.03397)
    (1.44e-05     0.02906)
    (1.48e-05     0.02485)
    (1.52e-05     0.02126)
    (1.56e-05     0.01818)
    (1.60e-05     0.01555)
    (1.64e-05     0.01330)
    (1.68e-05     0.01138)
    (1.72e-05     0.00973)
    (1.76e-05     0.00832)
    (1.80e-05     0.00712)
    (1.84e-05     0.00609)
    (1.88e-05     0.00521)
    (1.92e-05     0.00446)
    (1.96e-05     0.00381)
    (2.00e-05     0.00326)
);

bubbleGeneralPDFs_cluster
(
    // Bubble PDF size distribution for cluster
    // PDF normalization: \int F(dEqu/1e-6) d dEqu = 1
    // (dEqu, Phi)
    (6.00e-06     0.36610)
    (6.40e-06     0.35063)
    (6.80e-06     0.33489)
    (7.20e-06     0.31896)
    (7.60e-06     0.30294)
    (8.00e-06     0.28693)
    (8.40e-06     0.27101)
    (8.80e-06     0.25526)
    (9.20e-06     0.23976)
    (9.60e-06     0.22457)
    (1.00e-05     0.20976)
    (1.04e-05     0.19538)
    (1.08e-05     0.18148)
    (1.12e-05     0.16810)
    (1.16e-05     0.15528)
    (1.20e-05     0.14303)
    (1.24e-05     0.13138)
    (1.28e-05     0.12035)
    (1.32e-05     0.10994)
    (1.36e-05     0.10014)
    (1.40e-05     0.09097)
    (1.44e-05     0.08241)
    (1.48e-05     0.07444)
    (1.52e-05     0.06706)
    (1.56e-05     0.06024)
    (1.60e-05     0.05397)
    (1.64e-05     0.04821)
    (1.68e-05     0.04295)
    (1.72e-05     0.03816)
    (1.76e-05     0.03380)
    (1.80e-05     0.02986)
    (1.84e-05     0.02631)
    (1.88e-05     0.02311)
    (1.92e-05     0.02025)
    (1.96e-05     0.01769)
    (2.00e-05     0.01541)
);

bubbleGeneralPDFs_mergedCluster
(
    // Bubble PDF size distribution for mergedCluster
    // PDF normalization: \int F(dEqu/1e-6) d dEqu = 1
    // (dEqu, Phi)
    (6.00e-06     0.63589)
    (6.40e-06     0.56073)
    (6.80e-06     0.49445)
    (7.20e-06     0.43601)
    (7.60e-06     0.38448)
    (8.00e-06     0.33903)
    (8.40e-06     0.29896)
    (8.80e-06     0.26362)
    (9.20e-06     0.23246)
    (9.60e-06     0.20499)
    (1.00e-05     0.18076)
    (1.04e-05     0.15939)
    (1.08e-05     0.14055)
    (1.12e-05     0.12394)
    (1.16e-05     0.10929)
    (1.20e-05     0.09637)
    (1.24e-05     0.08498)
    (1.28e-05     0.07494)
    (1.32e-05     0.06608)
    (1.36e-05     0.05827)
    (1.40e-05     0.05138)
    (1.44e-05     0.04531)
    (1.48e-05     0.03995)
    (1.52e-05     0.03523)
    (1.56e-05     0.03107)
    (1.60e-05     0.02740)
    (1.64e-05     0.02416)
    (1.68e-05     0.02130)
    (1.72e-05     0.01878)
    (1.76e-05     0.01656)
    (1.80e-05     0.01461)
    (1.84e-05     0.01288)
    (1.88e-05     0.01136)
    (1.92e-05     0.01001)
    (1.96e-05     0.00883)
    (2.00e-05     0.00779)
);

bubbleGeneralPDFs_filament
(
    // Bubble PDF size distribution for filament
    // PDF normalization: \int F(dEqu/1e-6) d dEqu = 1
    // (dEqu, Phi)
    (6.00e-06     3.67598)
    (6.40e-06     1.72298)
    (6.80e-06     0.77138)
    (7.20e-06     0.33134)
    (7.60e-06     0.13808)
    (8.00e-06     0.05738)
    (8.40e-06     0.02525)
    (8.80e-06     0.01298)
    (9.20e-06     0.00841)
    (9.60e-06     0.00667)
    (1.00e-05     0.00593)
    (1.04e-05     0.00552)
    (1.08e-05     0.00523)
    (1.12e-05     0.00498)
    (1.16e-05     0.00475)
    (1.20e-05     0.00453)
    (1.24e-05     0.00433)
    (1.28e-05     0.00413)
    (1.32e-05     0.00394)
    (1.36e-05     0.00376)
    (1.40e-05     0.00359)
    (1.44e-05     0.00342)
    (1.48e-05     0.00327)
    (1.52e-05     0.00312)
    (1.56e-05     0.00297)
    (1.60e-05     0.00284)
    (1.64e-05     0.00271)
    (1.68e-05     0.00258)
    (1.72e-05     0.00247)
    (1.76e-05     0.00235)
    (1.80e-05     0.00225)
    (1.84e-05     0.00214)
    (1.88e-05     0.00204)
    (1.92e-05     0.00195)
    (1.96e-05     0.00186)
    (2.00e-05     0.00178)
);
