run/acousticCavitationCloudFoam/verification_wedge2D_Louisnard2012/constant/charactMap_Ic_OF
// A characteristic map for 
// Ic(REqu, pAc)
// data(
//     equilibrium radius,
//     acoustic pressure amplitude
// )
//
// Loaded via transportProperties.
//
// Table structure:
//  (
//      REqu 1
//      (
//          (pAc 1     Ic 1)
//          (pAc 2     Ic 2)
//          (...)
//      )
//      REqu 2
//      (...
//      )
//  )
(
    (
        1e-06
        (
            (0.000000e+00    0.000000e+00)
            (1.013000e+04    1.117639e-19)
            (1.519500e+04    1.681757e-19)
            (2.026000e+04    2.252328e-19)
            (2.532500e+04    2.831665e-19)
            (3.039000e+04    3.422228e-19)
            (3.545500e+04    4.026672e-19)
            (4.052000e+04    4.647902e-19)
            (4.558500e+04    5.289139e-19)
            (5.065000e+04    5.954005e-19)
            (5.571500e+04    6.646625e-19)
            (6.078000e+04    7.371753e-19)
            (6.584500e+04    8.134951e-19)
            (7.091000e+04    8.942812e-19)
            (7.597500e+04    9.803254e-19)
            (8.104000e+04    1.072595e-18)
            (8.610500e+04    1.172290e-18)
            (9.117000e+04    1.280930e-18)
            (9.623500e+04    1.400480e-18)
            (1.013000e+05    1.533546e-18)
            (1.063650e+05    1.683698e-18)
            (1.114300e+05    1.856009e-18)
            (1.164950e+05    2.058063e-18)
            (1.215600e+05    2.301975e-18)
            (1.266250e+05    2.609072e-18)
            (1.316900e+05    3.023241e-18)
            (1.367550e+05    3.668753e-18)
            (1.418200e+05    3.337686e-16)
            (1.468850e+05    1.200204e-14)
            (1.519500e+05    2.510235e-14)
            (1.570150e+05    3.681700e-14)
            (1.620800e+05    4.475680e-14)
            (1.671450e+05    4.673583e-14)
            (1.722100e+05    4.075071e-14)
            (1.772750e+05    2.497479e-14)
            (1.823400e+05    -2.246559e-15)
            (1.874050e+05    -4.240339e-14)
            (1.924700e+05    -9.682965e-14)
            (1.975350e+05    -1.667116e-13)
            (2.026000e+05    -2.530988e-13)
            (2.076650e+05    -3.569133e-13)
            (2.127300e+05    -4.789604e-13)
            (2.177950e+05    -6.199379e-13)
            (2.228600e+05    -7.804479e-13)
            (2.279250e+05    -9.610034e-13)
            (2.329900e+05    -1.162037e-12)
            (2.380550e+05    -1.383912e-12)
            (2.431200e+05    -1.626923e-12)
            (2.481850e+05    -1.891312e-12)
            (2.532500e+05    -2.177262e-12)
        )
    )
    (
        2e-06
        (
            (0.000000e+00    0.000000e+00)
            (1.013000e+04    1.198524e-18)
            (1.519500e+04    1.807246e-18)
            (2.026000e+04    2.427590e-18)
            (2.532500e+04    3.063898e-18)
            (3.039000e+04    3.720967e-18)
            (3.545500e+04    4.404184e-18)
            (4.052000e+04    5.119745e-18)
            (4.558500e+04    5.874931e-18)
            (5.065000e+04    6.678457e-18)
            (5.571500e+04    7.540978e-18)
            (6.078000e+04    8.475786e-18)
            (6.584500e+04    9.499871e-18)
            (7.091000e+04    1.063547e-17)
            (7.597500e+04    1.191258e-17)
            (8.104000e+04    1.337302e-17)
            (8.610500e+04    1.507767e-17)
            (9.117000e+04    1.712000e-17)
            (9.623500e+04    1.965446e-17)
            (1.013000e+05    2.296492e-17)
            (1.063650e+05    2.767527e-17)
            (1.114300e+05    3.589130e-17)
            (1.164950e+05    8.134042e-17)
            (1.215600e+05    1.402301e-15)
            (1.266250e+05    6.881831e-15)
            (1.316900e+05    1.633684e-14)
            (1.367550e+05    2.841283e-14)
            (1.418200e+05    4.135223e-14)
            (1.468850e+05    5.320390e-14)
            (1.519500e+05    6.195384e-14)
            (1.570150e+05    6.561069e-14)
            (1.620800e+05    6.226057e-14)
            (1.671450e+05    5.010030e-14)
            (1.722100e+05    2.745625e-14)
            (1.772750e+05    -7.207625e-15)
            (1.823400e+05    -5.528759e-14)
            (1.874050e+05    -1.180420e-13)
            (1.924700e+05    -1.965980e-13)
            (1.975350e+05    -2.919600e-13)
            (2.026000e+05    -4.050149e-13)
            (2.076650e+05    -5.365387e-13)
...
);
