run/acousticCavitationCloudFoam/verification_wedge2D_Louisnard2012/constant/charactMap_Is_OF
// A characteristic map for 
// Is(REqu, pAc)
// data(
//     equilibrium radius,
//     acoustic pressure amplitude
// )
//
// Loaded via transportProperties.
//
// Table structure:
//  (
//      REqu 1
//      (
//          (pAc 1     Is 1)
//          (pAc 2     Is 2)
//          (...)
//      )
//      REqu 2
//      (...
//      )
//  )
(
    (
        1e-06
        (
            (0.000000e+00    0.000000e+00)
            (1.013000e+04    1.461408e-22)
            (1.519500e+04    2.204006e-22)
            (2.026000e+04    2.961179e-22)
            (2.532500e+04    3.738242e-22)
            (3.039000e+04    4.541352e-22)
            (3.545500e+04    5.376793e-22)
            (4.052000e+04    6.252010e-22)
            (4.558500e+04    7.174914e-22)
            (5.065000e+04    8.156341e-22)
            (5.571500e+04    9.207416e-22)
            (6.078000e+04    1.034234e-21)
            (6.584500e+04    1.157842e-21)
            (7.091000e+04    1.293827e-21)
            (7.597500e+04    1.444716e-21)
            (8.104000e+04    1.614072e-21)
            (8.610500e+04    1.806581e-21)
            (9.117000e+04    2.028176e-21)
            (9.623500e+04    2.287807e-21)
            (1.013000e+05    2.597838e-21)
            (1.063650e+05    2.976510e-21)
            (1.114300e+05    3.451769e-21)
            (1.164950e+05    4.072528e-21)
            (1.215600e+05    4.924145e-21)
            (1.266250e+05    6.187482e-21)
            (1.316900e+05    8.320853e-21)
            (1.367550e+05    1.321116e-20)
            (1.418200e+05    3.349263e-16)
            (1.468850e+05    2.535201e-14)
            (1.519500e+05    7.147597e-14)
            (1.570150e+05    1.385267e-13)
            (1.620800e+05    2.270347e-13)
            (1.671450e+05    3.373193e-13)
            (1.722100e+05    4.694547e-13)
            (1.772750e+05    6.232992e-13)
            (1.823400e+05    7.985339e-13)
            (1.874050e+05    9.946983e-13)
            (1.924700e+05    1.211222e-12)
            (1.975350e+05    1.447451e-12)
            (2.026000e+05    1.702669e-12)
            (2.076650e+05    1.976113e-12)
            (2.127300e+05    2.266994e-12)
            (2.177950e+05    2.574503e-12)
            (2.228600e+05    2.897824e-12)
            (2.279250e+05    3.236139e-12)
            (2.329900e+05    3.588636e-12)
            (2.380550e+05    3.954512e-12)
            (2.431200e+05    4.332976e-12)
            (2.481850e+05    4.723254e-12)
            (2.532500e+05    5.124587e-12)
        )
    )
    (
        2e-06
        (
            (0.000000e+00    0.000000e+00)
            (1.013000e+04    2.740112e-21)
            (1.519500e+04    4.143266e-21)
            (2.026000e+04    5.586768e-21)
            (2.532500e+04    7.087536e-21)
            (3.039000e+04    8.662618e-21)
            (3.545500e+04    1.033324e-20)
            (4.052000e+04    1.212450e-20)
            (4.558500e+04    1.406960e-20)
            (5.065000e+04    1.620098e-20)
            (5.571500e+04    1.857859e-20)
            (6.078000e+04    2.126062e-20)
            (6.584500e+04    2.434106e-20)
            (7.091000e+04    2.794281e-20)
            (7.597500e+04    3.225238e-20)
            (8.104000e+04    3.754188e-20)
            (8.610500e+04    4.425676e-20)
            (9.117000e+04    5.314460e-20)
            (9.623500e+04    6.566188e-20)
            (1.013000e+05    8.496709e-20)
            (1.063650e+05    1.202428e-19)
            (1.114300e+05    2.560229e-19)
            (1.164950e+05    1.028888e-17)
            (1.215600e+05    1.076588e-15)
            (1.266250e+05    8.311363e-15)
            (1.316900e+05    2.619175e-14)
            (1.367550e+05    5.784801e-14)
            (1.418200e+05    1.056661e-13)
            (1.468850e+05    1.714227e-13)
            (1.519500e+05    2.563799e-13)
            (1.570150e+05    3.613683e-13)
            (1.620800e+05    4.868608e-13)
            (1.671450e+05    6.330380e-13)
            (1.722100e+05    7.998433e-13)
            (1.772750e+05    9.870306e-13)
            (1.823400e+05    1.194203e-12)
            (1.874050e+05    1.420846e-12)
            (1.924700e+05    1.666356e-12)
            (1.975350e+05    1.930057e-12)
            (2.026000e+05    2.211225e-12)
            (2.076650e+05    2.509101e-12)
...
);
