run/acousticCavitationCloudFoam/verification_wedge2D_Louisnard2012/constant/charactMap_PiVi_OF
// A characteristic map for 
// PiVi(REqu, pAc)
// data(
//     equilibrium radius,
//     acoustic pressure amplitude
// )
//
// Loaded via transportProperties.
//
// Table structure:
//  (
//      REqu 1
//      (
//          (pAc 1     PiVi 1)
//          (pAc 2     PiVi 2)
//          (...)
//      )
//      REqu 2
//      (...
//      )
//  )
(
    (
        1e-06
        (
            (1.013000e+04    1.231280e-13)
            (1.519500e+04    2.788607e-13)
            (2.026000e+04    5.003546e-13)
            (2.532500e+04    7.912308e-13)
            (3.039000e+04    1.156375e-12)
            (3.545500e+04    1.602132e-12)
            (4.052000e+04    2.136571e-12)
            (4.558500e+04    2.769844e-12)
            (5.065000e+04    3.514665e-12)
            (5.571500e+04    4.386960e-12)
            (6.078000e+04    5.406754e-12)
            (6.584500e+04    6.599393e-12)
            (7.091000e+04    7.997250e-12)
            (7.597500e+04    9.642184e-12)
            (8.104000e+04    1.158909e-11)
            (8.610500e+04    1.391127e-11)
            (9.117000e+04    1.670866e-11)
            (9.623500e+04    2.012109e-11)
            (1.013000e+05    2.435029e-11)
            (1.063650e+05    2.969882e-11)
            (1.114300e+05    3.664295e-11)
            (1.164950e+05    4.598176e-11)
            (1.215600e+05    5.917817e-11)
            (1.266250e+05    7.927676e-11)
            (1.316900e+05    1.141127e-10)
            (1.367550e+05    1.958328e-10)
            (1.418200e+05    1.288985e-06)
            (1.468850e+05    1.991115e-05)
            (1.519500e+05    3.910271e-05)
            (1.570150e+05    6.056968e-05)
            (1.620800e+05    8.438060e-05)
            (1.671450e+05    1.104921e-04)
            (1.722100e+05    1.388541e-04)
            (1.772750e+05    1.694189e-04)
            (1.823400e+05    2.021078e-04)
            (1.874050e+05    2.368702e-04)
            (1.924700e+05    2.736389e-04)
            (1.975350e+05    3.123256e-04)
            (2.026000e+05    3.528408e-04)
            (2.076650e+05    3.950969e-04)
            (2.127300e+05    4.390124e-04)
            (2.177950e+05    4.845123e-04)
            (2.228600e+05    5.315293e-04)
            (2.279250e+05    5.800021e-04)
            (2.329900e+05    6.298760e-04)
            (2.380550e+05    6.810998e-04)
            (2.431200e+05    7.336270e-04)
            (2.481850e+05    7.874117e-04)
            (2.532500e+05    8.424049e-04)
        )
    )
    (
        2e-06
        (
            (1.013000e+04    1.759813e-12)
            (1.519500e+04    4.002516e-12)
            (2.026000e+04    7.224973e-12)
            (2.532500e+04    1.151575e-11)
            (3.039000e+04    1.699789e-11)
            (3.545500e+04    2.383713e-11)
            (4.052000e+04    3.225400e-11)
            (4.558500e+04    4.254123e-11)
            (5.065000e+04    5.508940e-11)
            (5.571500e+04    7.042530e-11)
            (6.078000e+04    8.927052e-11)
            (6.584500e+04    1.126345e-10)
            (7.091000e+04    1.419665e-10)
            (7.597500e+04    1.794161e-10)
            (8.104000e+04    2.283060e-10)
            (8.610500e+04    2.940488e-10)
            (9.117000e+04    3.860977e-10)
            (9.623500e+04    5.226420e-10)
            (1.013000e+05    7.442204e-10)
            (1.063650e+05    1.169985e-09)
            (1.114300e+05    2.844530e-09)
            (1.164950e+05    1.128079e-07)
            (1.215600e+05    3.018603e-06)
            (1.266250e+05    9.621761e-06)
            (1.316900e+05    1.967171e-05)
            (1.367550e+05    3.276812e-05)
            (1.418200e+05    4.869167e-05)
            (1.468850e+05    6.728052e-05)
            (1.519500e+05    8.840244e-05)
            (1.570150e+05    1.119516e-04)
            (1.620800e+05    1.378479e-04)
            (1.671450e+05    1.660343e-04)
            (1.722100e+05    1.964635e-04)
            (1.772750e+05    2.290907e-04)
            (1.823400e+05    2.638550e-04)
            (1.874050e+05    3.006664e-04)
            (1.924700e+05    3.394594e-04)
            (1.975350e+05    3.801955e-04)
            (2.026000e+05    4.227928e-04)
            (2.076650e+05    4.671691e-04)
            (2.127300e+05    5.132469e-04)
            (2.177950e+05    5.609517e-04)
...
);
