run/acousticCavitationCloudFoam/verification_wedge2D_Louisnard2012/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../system/numberOfSubdomains"

dynamicFvMesh   myLoadBalanceFvMesh;

myLoadBalanceFvMeshCoeffs
{
    imbalanceTrigger            0.001;

    injectedParcelsWeightAmplifier  0;

    useDecomposeParDict         yes;

    method                      parMetisByParcels;

    numberOfSubdomains          $nSubdomains;

    parMetisByParcelsCoeffs
    {
        cellWeightsFile         "cellWeightsBalancing";
    }

}

// ************************************************************************* //
